go-go-golems/esp32-s3-m5/0114-papers3-pulp-os/sdkconfig.defaults
# PaperS3 / ESP32-S3 pulp-os baseline (ESP-51 Phase 4).
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# PaperS3 has octal PSRAM; the runtime keeps frames/caches there later.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
# TLS handshakes for HTTP + WebSocket coexist with the UI only when mbedTLS
# uses PSRAM; internal-only allocation fragments the ~100 KiB internal heap.
# The PaperS3 has trusted octal PSRAM and the demo does not handle secrets in
# a hostile physical-memory threat model.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
# CONFIG_MBEDTLS_INTERNAL_MEM_ALLOC is not set
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=12288
CONFIG_COMPILER_ORPHAN_SECTIONS_WARNING=y

# 1000 Hz tick keeps millisecond-scale scheduler/refresh timing honest.
CONFIG_FREERTOS_HZ=1000

# Interactive control is exclusively on native USB Serial/JTAG.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# CONFIG_ESP_CONSOLE_UART_DEFAULT is not set
# CONFIG_ESP_CONSOLE_UART is not set
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# Long filenames on the SD card (books like "war-and-peace.txt").
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255

# Stable machine-readable logs.
CONFIG_LOG_COLORS=n
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y
